mokafari/DJS3/integration_tests/test_apps/dsp_integration/sdkconfig.defaults
# ESP32-S3 Target Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Main Task Stack Size (increased for test suite)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# Log Configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
